HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxMtu_reg.h
/**
 * \file IfxMtu_reg.h
 * \brief
 * \copyright Copyright (c) 2018 Infineon Technologies AG. All rights reserved.
 *
 *
 * Version: TC38XA_UM_V1.0.0.R0
 * Specification: TC3xx User Manual V1.0.0
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxSfr_Mtu_Registers_Cfg Mtu address
 * \ingroup IfxSfr_Mtu_Registers
 * 
 * \defgroup IfxSfr_Mtu_Registers_Cfg_BaseAddress Base address
 * \ingroup IfxSfr_Mtu_Registers_Cfg
 *
 * \defgroup IfxSfr_Mtu_Registers_Cfg_Mtu 2-MTU
 * \ingroup IfxSfr_Mtu_Registers_Cfg
 *
 *
 */
#ifndef IFXMTU_REG_H
#define IFXMTU_REG_H 1
/******************************************************************************/
#include "IfxMtu_regdef.h"
/******************************************************************************/

/******************************************************************************/

/******************************************************************************/

/** \addtogroup IfxSfr_Mtu_Registers_Cfg_BaseAddress
 * \{  */

/** \brief MTU object */
#define MODULE_MTU /*lint --e(923, 9078)*/ ((*(Ifx_MTU*)0xF0060000u))
/** \}  */


/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Mtu_Registers_Cfg_Mtu
 * \{  */
/** \brief 0, Clock Control Register */
#define MTU_CLC /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_CLC*)0xF0060000u)

/** \brief 8, Identification Register */
#define MTU_ID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_ID*)0xF0060008u)

/** \brief 10, Memory MBIST Enable Register 0 */
#define MTU_MEMTEST0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MEMTEST0*)0xF0060010u)

/** \brief 14, Memory MBIST Enable Register 1 */
#define MTU_MEMTEST1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MEMTEST1*)0xF0060014u)

/** \brief 18, Memory MBIST Enable Register 2 */
#define MTU_MEMTEST2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MEMTEST2*)0xF0060018u)

/** \brief 1C, Memory Mapping Enable Register */
#define MTU_MEMMAP /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MEMMAP*)0xF006001Cu)

/** \brief 38, Memory Status Register 0 */
#define MTU_MEMSTAT0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MEMSTAT0*)0xF0060038u)

/** \brief 3C, Memory Status Register 1 */
#define MTU_MEMSTAT1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MEMSTAT1*)0xF006003Cu)

/** \brief 40, Memory Status Register 2 */
#define MTU_MEMSTAT2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MEMSTAT2*)0xF0060040u)

/** \brief 50, Memory Test Done Status Register 0 */
#define MTU_MEMDONE0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MEMDONE0*)0xF0060050u)

/** \brief 54, Memory Test Done Status Register 1 */
#define MTU_MEMDONE1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MEMDONE1*)0xF0060054u)

/** \brief 58, Memory Test Done Status Register 2 */
#define MTU_MEMDONE2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MEMDONE2*)0xF0060058u)

/** \brief 60, Memory Test FDA Status Register 0 */
#define MTU_MEMFDA0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MEMFDA0*)0xF0060060u)

/** \brief 64, Memory Test FDA Status Register 1 */
#define MTU_MEMFDA1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MEMFDA1*)0xF0060064u)

/** \brief 68, Memory Test FDA Status Register 2 */
#define MTU_MEMFDA2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MEMFDA2*)0xF0060068u)

/** \brief F8, Access Enable Register 1 */
#define MTU_ACCEN1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_ACCEN1*)0xF00600F8u)

/** \brief FC, Access Enable Register 0 */
#define MTU_ACCEN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_ACCEN0*)0xF00600FCu)

/** \brief 0, Configuration Registers */
#define MTU_MC0_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0061000u)

/** \brief 2, Configuration Register 1 */
#define MTU_MC0_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0061002u)

/** \brief 4, MBIST Control Register */
#define MTU_MC0_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0061004u)

/** \brief 6, Status Register */
#define MTU_MC0_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0061006u)

/** \brief 8, Range Register, single address mode */
#define MTU_MC0_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0061008u)

/** \brief C, Revision ID Register */
#define MTU_MC0_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006100Cu)

/** \brief E, ECC Safety Register */
#define MTU_MC0_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006100Eu)

/** \brief 10, Memory ECC Detection Register */
#define MTU_MC0_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0061010u)

/** \brief 12, Error Tracking Register 0 */
#define MTU_MC0_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061012u)

/** \brief 14, Error Tracking Register 1 */
#define MTU_MC0_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061014u)

/** \brief 16, Error Tracking Register 2 */
#define MTU_MC0_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061016u)

/** \brief 18, Error Tracking Register 3 */
#define MTU_MC0_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061018u)

/** \brief 1A, Error Tracking Register 4 */
#define MTU_MC0_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006101Au)

/** \brief 60, Read Data and Bit Flip Register 0 */
#define MTU_MC0_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061060u)

