HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxMtu_reg.h
/** \brief 5CE, Read Data and Bit Flip Register 55 */
#define MTU_MC5_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615CEu)

/** \brief 5D0, Read Data and Bit Flip Register 56 */
#define MTU_MC5_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615D0u)

/** \brief 5D2, Read Data and Bit Flip Register 57 */
#define MTU_MC5_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615D2u)

/** \brief 5D4, Read Data and Bit Flip Register 58 */
#define MTU_MC5_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615D4u)

/** \brief 5D6, Read Data and Bit Flip Register 59 */
#define MTU_MC5_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615D6u)

/** \brief 5D8, Read Data and Bit Flip Register 60 */
#define MTU_MC5_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615D8u)

/** \brief 5DA, Read Data and Bit Flip Register 61 */
#define MTU_MC5_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615DAu)

/** \brief 5DC, Read Data and Bit Flip Register 62 */
#define MTU_MC5_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615DCu)

/** \brief 5DE, Read Data and Bit Flip Register 63 */
#define MTU_MC5_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615DEu)

/** \brief 5E0, Read Data and Bit Flip Register 64 */
#define MTU_MC5_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615E0u)

/** \brief 5E2, Read Data and Bit Flip Register 65 */
#define MTU_MC5_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615E2u)

/** \brief 5E4, Read Data and Bit Flip Register 66 */
#define MTU_MC5_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00615E4u)

/** \brief 5EE, Alarm Sources Configuration Register */
#define MTU_MC5_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF00615EEu)

/** \brief 5F0, SSH Safety Faults Status Register  */
#define MTU_MC5_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF00615F0u)

/** \brief 5F2, Error Information Register 0 */
#define MTU_MC5_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00615F2u)

/** \brief 5F4, Error Information Register 1 */
#define MTU_MC5_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00615F4u)

/** \brief 5F6, Error Information Register 2 */
#define MTU_MC5_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00615F6u)

/** \brief 5F8, Error Information Register 3 */
#define MTU_MC5_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00615F8u)

/** \brief 5FA, Error Information Register 4 */
#define MTU_MC5_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00615FAu)

/** \brief 600, Configuration Registers */
#define MTU_MC6_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0061600u)

/** \brief 602, Configuration Register 1 */
#define MTU_MC6_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0061602u)

/** \brief 604, MBIST Control Register */
#define MTU_MC6_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0061604u)

/** \brief 606, Status Register */
#define MTU_MC6_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0061606u)

/** \brief 608, Range Register, single address mode */
#define MTU_MC6_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0061608u)

/** \brief 60C, Revision ID Register */
#define MTU_MC6_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006160Cu)

/** \brief 60E, ECC Safety Register */
#define MTU_MC6_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006160Eu)

/** \brief 610, Memory ECC Detection Register */
#define MTU_MC6_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0061610u)

/** \brief 612, Error Tracking Register 0 */
#define MTU_MC6_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061612u)

/** \brief 614, Error Tracking Register 1 */
#define MTU_MC6_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061614u)

/** \brief 616, Error Tracking Register 2 */
#define MTU_MC6_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061616u)

/** \brief 618, Error Tracking Register 3 */
#define MTU_MC6_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061618u)

/** \brief 61A, Error Tracking Register 4 */
#define MTU_MC6_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006161Au)

/** \brief 660, Read Data and Bit Flip Register 0 */
#define MTU_MC6_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061660u)

/** \brief 662, Read Data and Bit Flip Register 1 */
#define MTU_MC6_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061662u)

/** \brief 664, Read Data and Bit Flip Register 2 */
#define MTU_MC6_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061664u)

/** \brief 666, Read Data and Bit Flip Register 3 */
#define MTU_MC6_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061666u)

/** \brief 668, Read Data and Bit Flip Register 4 */
#define MTU_MC6_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061668u)

/** \brief 66A, Read Data and Bit Flip Register 5 */
#define MTU_MC6_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006166Au)

/** \brief 66C, Read Data and Bit Flip Register 6 */
#define MTU_MC6_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006166Cu)

/** \brief 66E, Read Data and Bit Flip Register 7 */
#define MTU_MC6_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006166Eu)

/** \brief 670, Read Data and Bit Flip Register 8 */
#define MTU_MC6_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061670u)

/** \brief 672, Read Data and Bit Flip Register 9 */
#define MTU_MC6_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061672u)

/** \brief 674, Read Data and Bit Flip Register 10 */
#define MTU_MC6_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061674u)

/** \brief 676, Read Data and Bit Flip Register 11 */
#define MTU_MC6_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061676u)

/** \brief 678, Read Data and Bit Flip Register 12 */
#define MTU_MC6_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061678u)

/** \brief 67A, Read Data and Bit Flip Register 13 */
#define MTU_MC6_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006167Au)

/** \brief 67C, Read Data and Bit Flip Register 14 */
#define MTU_MC6_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006167Cu)

