HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxMtu_reg.h
/** \brief 67E, Read Data and Bit Flip Register 15 */
#define MTU_MC6_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006167Eu)

/** \brief 680, Read Data and Bit Flip Register 16 */
#define MTU_MC6_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061680u)

/** \brief 682, Read Data and Bit Flip Register 17 */
#define MTU_MC6_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061682u)

/** \brief 684, Read Data and Bit Flip Register 18 */
#define MTU_MC6_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061684u)

/** \brief 686, Read Data and Bit Flip Register 19 */
#define MTU_MC6_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061686u)

/** \brief 688, Read Data and Bit Flip Register 20 */
#define MTU_MC6_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061688u)

/** \brief 68A, Read Data and Bit Flip Register 21 */
#define MTU_MC6_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006168Au)

/** \brief 68C, Read Data and Bit Flip Register 22 */
#define MTU_MC6_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006168Cu)

/** \brief 68E, Read Data and Bit Flip Register 23 */
#define MTU_MC6_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006168Eu)

/** \brief 690, Read Data and Bit Flip Register 24 */
#define MTU_MC6_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061690u)

/** \brief 692, Read Data and Bit Flip Register 25 */
#define MTU_MC6_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061692u)

/** \brief 694, Read Data and Bit Flip Register 26 */
#define MTU_MC6_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061694u)

/** \brief 696, Read Data and Bit Flip Register 27 */
#define MTU_MC6_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061696u)

/** \brief 698, Read Data and Bit Flip Register 28 */
#define MTU_MC6_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061698u)

/** \brief 69A, Read Data and Bit Flip Register 29 */
#define MTU_MC6_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006169Au)

/** \brief 69C, Read Data and Bit Flip Register 30 */
#define MTU_MC6_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006169Cu)

/** \brief 69E, Read Data and Bit Flip Register 31 */
#define MTU_MC6_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006169Eu)

/** \brief 6A0, Read Data and Bit Flip Register 32 */
#define MTU_MC6_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616A0u)

/** \brief 6A2, Read Data and Bit Flip Register 33 */
#define MTU_MC6_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616A2u)

/** \brief 6A4, Read Data and Bit Flip Register 34 */
#define MTU_MC6_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616A4u)

/** \brief 6A6, Read Data and Bit Flip Register 35 */
#define MTU_MC6_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616A6u)

/** \brief 6A8, Read Data and Bit Flip Register 36 */
#define MTU_MC6_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616A8u)

/** \brief 6AA, Read Data and Bit Flip Register 37 */
#define MTU_MC6_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616AAu)

/** \brief 6AC, Read Data and Bit Flip Register 38 */
#define MTU_MC6_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616ACu)

/** \brief 6AE, Read Data and Bit Flip Register 39 */
#define MTU_MC6_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616AEu)

/** \brief 6B0, Read Data and Bit Flip Register 40 */
#define MTU_MC6_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616B0u)

/** \brief 6B2, Read Data and Bit Flip Register 41 */
#define MTU_MC6_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616B2u)

/** \brief 6B4, Read Data and Bit Flip Register 42 */
#define MTU_MC6_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616B4u)

/** \brief 6B6, Read Data and Bit Flip Register 43 */
#define MTU_MC6_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616B6u)

/** \brief 6B8, Read Data and Bit Flip Register 44 */
#define MTU_MC6_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616B8u)

/** \brief 6BA, Read Data and Bit Flip Register 45 */
#define MTU_MC6_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616BAu)

/** \brief 6BC, Read Data and Bit Flip Register 46 */
#define MTU_MC6_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616BCu)

/** \brief 6BE, Read Data and Bit Flip Register 47 */
#define MTU_MC6_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616BEu)

/** \brief 6C0, Read Data and Bit Flip Register 48 */
#define MTU_MC6_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616C0u)

/** \brief 6C2, Read Data and Bit Flip Register 49 */
#define MTU_MC6_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616C2u)

/** \brief 6C4, Read Data and Bit Flip Register 50 */
#define MTU_MC6_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616C4u)

/** \brief 6C6, Read Data and Bit Flip Register 51 */
#define MTU_MC6_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616C6u)

/** \brief 6C8, Read Data and Bit Flip Register 52 */
#define MTU_MC6_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616C8u)

/** \brief 6CA, Read Data and Bit Flip Register 53 */
#define MTU_MC6_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616CAu)

/** \brief 6CC, Read Data and Bit Flip Register 54 */
#define MTU_MC6_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616CCu)

/** \brief 6CE, Read Data and Bit Flip Register 55 */
#define MTU_MC6_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616CEu)

/** \brief 6D0, Read Data and Bit Flip Register 56 */
#define MTU_MC6_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616D0u)

/** \brief 6D2, Read Data and Bit Flip Register 57 */
#define MTU_MC6_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616D2u)

