HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxMtu_reg.h
/** \brief 6D4, Read Data and Bit Flip Register 58 */
#define MTU_MC6_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616D4u)

/** \brief 6D6, Read Data and Bit Flip Register 59 */
#define MTU_MC6_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616D6u)

/** \brief 6D8, Read Data and Bit Flip Register 60 */
#define MTU_MC6_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616D8u)

/** \brief 6DA, Read Data and Bit Flip Register 61 */
#define MTU_MC6_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616DAu)

/** \brief 6DC, Read Data and Bit Flip Register 62 */
#define MTU_MC6_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616DCu)

/** \brief 6DE, Read Data and Bit Flip Register 63 */
#define MTU_MC6_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616DEu)

/** \brief 6E0, Read Data and Bit Flip Register 64 */
#define MTU_MC6_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616E0u)

/** \brief 6E2, Read Data and Bit Flip Register 65 */
#define MTU_MC6_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616E2u)

/** \brief 6E4, Read Data and Bit Flip Register 66 */
#define MTU_MC6_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00616E4u)

/** \brief 6EE, Alarm Sources Configuration Register */
#define MTU_MC6_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF00616EEu)

/** \brief 6F0, SSH Safety Faults Status Register  */
#define MTU_MC6_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF00616F0u)

/** \brief 6F2, Error Information Register 0 */
#define MTU_MC6_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00616F2u)

/** \brief 6F4, Error Information Register 1 */
#define MTU_MC6_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00616F4u)

/** \brief 6F6, Error Information Register 2 */
#define MTU_MC6_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00616F6u)

/** \brief 6F8, Error Information Register 3 */
#define MTU_MC6_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00616F8u)

/** \brief 6FA, Error Information Register 4 */
#define MTU_MC6_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00616FAu)

/** \brief 700, Configuration Registers */
#define MTU_MC7_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0061700u)

/** \brief 702, Configuration Register 1 */
#define MTU_MC7_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0061702u)

/** \brief 704, MBIST Control Register */
#define MTU_MC7_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0061704u)

/** \brief 706, Status Register */
#define MTU_MC7_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0061706u)

/** \brief 708, Range Register, single address mode */
#define MTU_MC7_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0061708u)

/** \brief 70C, Revision ID Register */
#define MTU_MC7_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006170Cu)

/** \brief 70E, ECC Safety Register */
#define MTU_MC7_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006170Eu)

/** \brief 710, Memory ECC Detection Register */
#define MTU_MC7_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0061710u)

/** \brief 712, Error Tracking Register 0 */
#define MTU_MC7_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061712u)

/** \brief 714, Error Tracking Register 1 */
#define MTU_MC7_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061714u)

/** \brief 716, Error Tracking Register 2 */
#define MTU_MC7_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061716u)

/** \brief 718, Error Tracking Register 3 */
#define MTU_MC7_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061718u)

/** \brief 71A, Error Tracking Register 4 */
#define MTU_MC7_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006171Au)

/** \brief 760, Read Data and Bit Flip Register 0 */
#define MTU_MC7_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061760u)

/** \brief 762, Read Data and Bit Flip Register 1 */
#define MTU_MC7_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061762u)

/** \brief 764, Read Data and Bit Flip Register 2 */
#define MTU_MC7_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061764u)

/** \brief 766, Read Data and Bit Flip Register 3 */
#define MTU_MC7_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061766u)

/** \brief 768, Read Data and Bit Flip Register 4 */
#define MTU_MC7_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061768u)

/** \brief 76A, Read Data and Bit Flip Register 5 */
#define MTU_MC7_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006176Au)

/** \brief 76C, Read Data and Bit Flip Register 6 */
#define MTU_MC7_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006176Cu)

/** \brief 76E, Read Data and Bit Flip Register 7 */
#define MTU_MC7_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006176Eu)

/** \brief 770, Read Data and Bit Flip Register 8 */
#define MTU_MC7_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061770u)

/** \brief 772, Read Data and Bit Flip Register 9 */
#define MTU_MC7_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061772u)

/** \brief 774, Read Data and Bit Flip Register 10 */
#define MTU_MC7_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061774u)

/** \brief 776, Read Data and Bit Flip Register 11 */
#define MTU_MC7_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061776u)

/** \brief 778, Read Data and Bit Flip Register 12 */
#define MTU_MC7_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061778u)

/** \brief 77A, Read Data and Bit Flip Register 13 */
#define MTU_MC7_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006177Au)

/** \brief 77C, Read Data and Bit Flip Register 14 */
#define MTU_MC7_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006177Cu)

/** \brief 77E, Read Data and Bit Flip Register 15 */
#define MTU_MC7_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006177Eu)

/** \brief 780, Read Data and Bit Flip Register 16 */
#define MTU_MC7_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061780u)

/** \brief 782, Read Data and Bit Flip Register 17 */
#define MTU_MC7_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061782u)

/** \brief 784, Read Data and Bit Flip Register 18 */
#define MTU_MC7_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061784u)

/** \brief 786, Read Data and Bit Flip Register 19 */
#define MTU_MC7_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061786u)

/** \brief 788, Read Data and Bit Flip Register 20 */
#define MTU_MC7_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061788u)

/** \brief 78A, Read Data and Bit Flip Register 21 */
#define MTU_MC7_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006178Au)

/** \brief 78C, Read Data and Bit Flip Register 22 */
#define MTU_MC7_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006178Cu)

/** \brief 78E, Read Data and Bit Flip Register 23 */
#define MTU_MC7_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006178Eu)

/** \brief 790, Read Data and Bit Flip Register 24 */
#define MTU_MC7_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061790u)

/** \brief 792, Read Data and Bit Flip Register 25 */
#define MTU_MC7_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061792u)

/** \brief 794, Read Data and Bit Flip Register 26 */
#define MTU_MC7_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061794u)

/** \brief 796, Read Data and Bit Flip Register 27 */
#define MTU_MC7_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061796u)

