HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxMtu_reg.h
/** \brief 802, Configuration Register 1 */
#define MTU_MC8_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0061802u)

/** \brief 804, MBIST Control Register */
#define MTU_MC8_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0061804u)

/** \brief 806, Status Register */
#define MTU_MC8_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0061806u)

/** \brief 808, Range Register, single address mode */
#define MTU_MC8_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0061808u)

/** \brief 80C, Revision ID Register */
#define MTU_MC8_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006180Cu)

/** \brief 80E, ECC Safety Register */
#define MTU_MC8_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006180Eu)

/** \brief 810, Memory ECC Detection Register */
#define MTU_MC8_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0061810u)

/** \brief 812, Error Tracking Register 0 */
#define MTU_MC8_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061812u)

/** \brief 814, Error Tracking Register 1 */
#define MTU_MC8_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061814u)

/** \brief 816, Error Tracking Register 2 */
#define MTU_MC8_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061816u)

/** \brief 818, Error Tracking Register 3 */
#define MTU_MC8_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061818u)

/** \brief 81A, Error Tracking Register 4 */
#define MTU_MC8_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006181Au)

/** \brief 860, Read Data and Bit Flip Register 0 */
#define MTU_MC8_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061860u)

/** \brief 862, Read Data and Bit Flip Register 1 */
#define MTU_MC8_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061862u)

/** \brief 864, Read Data and Bit Flip Register 2 */
#define MTU_MC8_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061864u)

/** \brief 866, Read Data and Bit Flip Register 3 */
#define MTU_MC8_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061866u)

/** \brief 868, Read Data and Bit Flip Register 4 */
#define MTU_MC8_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061868u)

/** \brief 86A, Read Data and Bit Flip Register 5 */
#define MTU_MC8_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006186Au)

/** \brief 86C, Read Data and Bit Flip Register 6 */
#define MTU_MC8_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006186Cu)

/** \brief 86E, Read Data and Bit Flip Register 7 */
#define MTU_MC8_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006186Eu)

/** \brief 870, Read Data and Bit Flip Register 8 */
#define MTU_MC8_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061870u)

/** \brief 872, Read Data and Bit Flip Register 9 */
#define MTU_MC8_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061872u)

/** \brief 874, Read Data and Bit Flip Register 10 */
#define MTU_MC8_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061874u)

/** \brief 876, Read Data and Bit Flip Register 11 */
#define MTU_MC8_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061876u)

/** \brief 878, Read Data and Bit Flip Register 12 */
#define MTU_MC8_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061878u)

/** \brief 87A, Read Data and Bit Flip Register 13 */
#define MTU_MC8_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006187Au)

/** \brief 87C, Read Data and Bit Flip Register 14 */
#define MTU_MC8_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006187Cu)

/** \brief 87E, Read Data and Bit Flip Register 15 */
#define MTU_MC8_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006187Eu)

/** \brief 880, Read Data and Bit Flip Register 16 */
#define MTU_MC8_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061880u)

/** \brief 882, Read Data and Bit Flip Register 17 */
#define MTU_MC8_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061882u)

/** \brief 884, Read Data and Bit Flip Register 18 */
#define MTU_MC8_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061884u)

/** \brief 886, Read Data and Bit Flip Register 19 */
#define MTU_MC8_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061886u)

/** \brief 888, Read Data and Bit Flip Register 20 */
#define MTU_MC8_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061888u)

/** \brief 88A, Read Data and Bit Flip Register 21 */
#define MTU_MC8_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006188Au)

/** \brief 88C, Read Data and Bit Flip Register 22 */
#define MTU_MC8_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006188Cu)

/** \brief 88E, Read Data and Bit Flip Register 23 */
#define MTU_MC8_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006188Eu)

/** \brief 890, Read Data and Bit Flip Register 24 */
#define MTU_MC8_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061890u)

/** \brief 892, Read Data and Bit Flip Register 25 */
#define MTU_MC8_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061892u)

/** \brief 894, Read Data and Bit Flip Register 26 */
#define MTU_MC8_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061894u)

/** \brief 896, Read Data and Bit Flip Register 27 */
#define MTU_MC8_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061896u)

/** \brief 898, Read Data and Bit Flip Register 28 */
#define MTU_MC8_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061898u)

/** \brief 89A, Read Data and Bit Flip Register 29 */
#define MTU_MC8_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006189Au)

/** \brief 89C, Read Data and Bit Flip Register 30 */
#define MTU_MC8_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006189Cu)

/** \brief 89E, Read Data and Bit Flip Register 31 */
#define MTU_MC8_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006189Eu)

/** \brief 8A0, Read Data and Bit Flip Register 32 */
#define MTU_MC8_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618A0u)

/** \brief 8A2, Read Data and Bit Flip Register 33 */
#define MTU_MC8_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618A2u)

/** \brief 8A4, Read Data and Bit Flip Register 34 */
#define MTU_MC8_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00618A4u)

