HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxMtu_reg.h
/** \brief B72, Read Data and Bit Flip Register 9 */
#define MTU_MC11_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061B72u)

/** \brief B74, Read Data and Bit Flip Register 10 */
#define MTU_MC11_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061B74u)

/** \brief B76, Read Data and Bit Flip Register 11 */
#define MTU_MC11_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061B76u)

/** \brief B78, Read Data and Bit Flip Register 12 */
#define MTU_MC11_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061B78u)

/** \brief B7A, Read Data and Bit Flip Register 13 */
#define MTU_MC11_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061B7Au)

/** \brief B7C, Read Data and Bit Flip Register 14 */
#define MTU_MC11_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061B7Cu)

/** \brief B7E, Read Data and Bit Flip Register 15 */
#define MTU_MC11_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061B7Eu)

/** \brief B80, Read Data and Bit Flip Register 16 */
#define MTU_MC11_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061B80u)

/** \brief B82, Read Data and Bit Flip Register 17 */
#define MTU_MC11_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061B82u)

/** \brief B84, Read Data and Bit Flip Register 18 */
#define MTU_MC11_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061B84u)

/** \brief B86, Read Data and Bit Flip Register 19 */
#define MTU_MC11_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061B86u)

/** \brief B88, Read Data and Bit Flip Register 20 */
#define MTU_MC11_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061B88u)

/** \brief B8A, Read Data and Bit Flip Register 21 */
#define MTU_MC11_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061B8Au)

/** \brief B8C, Read Data and Bit Flip Register 22 */
#define MTU_MC11_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061B8Cu)

/** \brief B8E, Read Data and Bit Flip Register 23 */
#define MTU_MC11_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061B8Eu)

/** \brief B90, Read Data and Bit Flip Register 24 */
#define MTU_MC11_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061B90u)

/** \brief B92, Read Data and Bit Flip Register 25 */
#define MTU_MC11_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061B92u)

/** \brief B94, Read Data and Bit Flip Register 26 */
#define MTU_MC11_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061B94u)

/** \brief B96, Read Data and Bit Flip Register 27 */
#define MTU_MC11_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061B96u)

/** \brief B98, Read Data and Bit Flip Register 28 */
#define MTU_MC11_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061B98u)

/** \brief B9A, Read Data and Bit Flip Register 29 */
#define MTU_MC11_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061B9Au)

/** \brief B9C, Read Data and Bit Flip Register 30 */
#define MTU_MC11_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061B9Cu)

/** \brief B9E, Read Data and Bit Flip Register 31 */
#define MTU_MC11_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061B9Eu)

/** \brief BA0, Read Data and Bit Flip Register 32 */
#define MTU_MC11_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BA0u)

/** \brief BA2, Read Data and Bit Flip Register 33 */
#define MTU_MC11_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BA2u)

/** \brief BA4, Read Data and Bit Flip Register 34 */
#define MTU_MC11_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BA4u)

/** \brief BA6, Read Data and Bit Flip Register 35 */
#define MTU_MC11_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BA6u)

/** \brief BA8, Read Data and Bit Flip Register 36 */
#define MTU_MC11_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BA8u)

/** \brief BAA, Read Data and Bit Flip Register 37 */
#define MTU_MC11_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BAAu)

/** \brief BAC, Read Data and Bit Flip Register 38 */
#define MTU_MC11_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BACu)

/** \brief BAE, Read Data and Bit Flip Register 39 */
#define MTU_MC11_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BAEu)

/** \brief BB0, Read Data and Bit Flip Register 40 */
#define MTU_MC11_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BB0u)

/** \brief BB2, Read Data and Bit Flip Register 41 */
#define MTU_MC11_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BB2u)

/** \brief BB4, Read Data and Bit Flip Register 42 */
#define MTU_MC11_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BB4u)

/** \brief BB6, Read Data and Bit Flip Register 43 */
#define MTU_MC11_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BB6u)

/** \brief BB8, Read Data and Bit Flip Register 44 */
#define MTU_MC11_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BB8u)

/** \brief BBA, Read Data and Bit Flip Register 45 */
#define MTU_MC11_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BBAu)

/** \brief BBC, Read Data and Bit Flip Register 46 */
#define MTU_MC11_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BBCu)

/** \brief BBE, Read Data and Bit Flip Register 47 */
#define MTU_MC11_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BBEu)

/** \brief BC0, Read Data and Bit Flip Register 48 */
#define MTU_MC11_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BC0u)

/** \brief BC2, Read Data and Bit Flip Register 49 */
#define MTU_MC11_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BC2u)

/** \brief BC4, Read Data and Bit Flip Register 50 */
#define MTU_MC11_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BC4u)

