HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxMtu_reg.h
/** \brief BC6, Read Data and Bit Flip Register 51 */
#define MTU_MC11_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BC6u)

/** \brief BC8, Read Data and Bit Flip Register 52 */
#define MTU_MC11_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BC8u)

/** \brief BCA, Read Data and Bit Flip Register 53 */
#define MTU_MC11_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BCAu)

/** \brief BCC, Read Data and Bit Flip Register 54 */
#define MTU_MC11_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BCCu)

/** \brief BCE, Read Data and Bit Flip Register 55 */
#define MTU_MC11_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BCEu)

/** \brief BD0, Read Data and Bit Flip Register 56 */
#define MTU_MC11_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BD0u)

/** \brief BD2, Read Data and Bit Flip Register 57 */
#define MTU_MC11_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BD2u)

/** \brief BD4, Read Data and Bit Flip Register 58 */
#define MTU_MC11_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BD4u)

/** \brief BD6, Read Data and Bit Flip Register 59 */
#define MTU_MC11_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BD6u)

/** \brief BD8, Read Data and Bit Flip Register 60 */
#define MTU_MC11_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BD8u)

/** \brief BDA, Read Data and Bit Flip Register 61 */
#define MTU_MC11_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BDAu)

/** \brief BDC, Read Data and Bit Flip Register 62 */
#define MTU_MC11_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BDCu)

/** \brief BDE, Read Data and Bit Flip Register 63 */
#define MTU_MC11_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BDEu)

/** \brief BE0, Read Data and Bit Flip Register 64 */
#define MTU_MC11_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BE0u)

/** \brief BE2, Read Data and Bit Flip Register 65 */
#define MTU_MC11_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BE2u)

/** \brief BE4, Read Data and Bit Flip Register 66 */
#define MTU_MC11_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061BE4u)

/** \brief BEE, Alarm Sources Configuration Register */
#define MTU_MC11_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF0061BEEu)

/** \brief BF0, SSH Safety Faults Status Register  */
#define MTU_MC11_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF0061BF0u)

/** \brief BF2, Error Information Register 0 */
#define MTU_MC11_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0061BF2u)

/** \brief BF4, Error Information Register 1 */
#define MTU_MC11_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0061BF4u)

/** \brief BF6, Error Information Register 2 */
#define MTU_MC11_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0061BF6u)

/** \brief BF8, Error Information Register 3 */
#define MTU_MC11_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0061BF8u)

/** \brief BFA, Error Information Register 4 */
#define MTU_MC11_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0061BFAu)

/** \brief C00, Configuration Registers */
#define MTU_MC12_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0061C00u)

/** \brief C02, Configuration Register 1 */
#define MTU_MC12_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0061C02u)

/** \brief C04, MBIST Control Register */
#define MTU_MC12_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0061C04u)

/** \brief C06, Status Register */
#define MTU_MC12_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0061C06u)

/** \brief C08, Range Register, single address mode */
#define MTU_MC12_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0061C08u)

/** \brief C0C, Revision ID Register */
#define MTU_MC12_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF0061C0Cu)

/** \brief C0E, ECC Safety Register */
#define MTU_MC12_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF0061C0Eu)

/** \brief C10, Memory ECC Detection Register */
#define MTU_MC12_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0061C10u)

/** \brief C12, Error Tracking Register 0 */
#define MTU_MC12_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061C12u)

/** \brief C14, Error Tracking Register 1 */
#define MTU_MC12_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061C14u)

/** \brief C16, Error Tracking Register 2 */
#define MTU_MC12_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061C16u)

/** \brief C18, Error Tracking Register 3 */
#define MTU_MC12_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061C18u)

/** \brief C1A, Error Tracking Register 4 */
#define MTU_MC12_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0061C1Au)

/** \brief C60, Read Data and Bit Flip Register 0 */
#define MTU_MC12_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061C60u)

/** \brief C62, Read Data and Bit Flip Register 1 */
#define MTU_MC12_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061C62u)

/** \brief C64, Read Data and Bit Flip Register 2 */
#define MTU_MC12_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061C64u)

/** \brief C66, Read Data and Bit Flip Register 3 */
#define MTU_MC12_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061C66u)

/** \brief C68, Read Data and Bit Flip Register 4 */
#define MTU_MC12_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061C68u)

/** \brief C6A, Read Data and Bit Flip Register 5 */
#define MTU_MC12_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061C6Au)

/** \brief C6C, Read Data and Bit Flip Register 6 */
#define MTU_MC12_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061C6Cu)

/** \brief C6E, Read Data and Bit Flip Register 7 */
#define MTU_MC12_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061C6Eu)

/** \brief C70, Read Data and Bit Flip Register 8 */
#define MTU_MC12_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061C70u)

/** \brief C72, Read Data and Bit Flip Register 9 */
#define MTU_MC12_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061C72u)

/** \brief C74, Read Data and Bit Flip Register 10 */
#define MTU_MC12_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061C74u)

/** \brief C76, Read Data and Bit Flip Register 11 */
#define MTU_MC12_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061C76u)

