HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxMtu_reg.h
/** \brief C78, Read Data and Bit Flip Register 12 */
#define MTU_MC12_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061C78u)

/** \brief C7A, Read Data and Bit Flip Register 13 */
#define MTU_MC12_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061C7Au)

/** \brief C7C, Read Data and Bit Flip Register 14 */
#define MTU_MC12_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061C7Cu)

/** \brief C7E, Read Data and Bit Flip Register 15 */
#define MTU_MC12_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061C7Eu)

/** \brief C80, Read Data and Bit Flip Register 16 */
#define MTU_MC12_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061C80u)

/** \brief C82, Read Data and Bit Flip Register 17 */
#define MTU_MC12_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061C82u)

/** \brief C84, Read Data and Bit Flip Register 18 */
#define MTU_MC12_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061C84u)

/** \brief C86, Read Data and Bit Flip Register 19 */
#define MTU_MC12_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061C86u)

/** \brief C88, Read Data and Bit Flip Register 20 */
#define MTU_MC12_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061C88u)

/** \brief C8A, Read Data and Bit Flip Register 21 */
#define MTU_MC12_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061C8Au)

/** \brief C8C, Read Data and Bit Flip Register 22 */
#define MTU_MC12_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061C8Cu)

/** \brief C8E, Read Data and Bit Flip Register 23 */
#define MTU_MC12_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061C8Eu)

/** \brief C90, Read Data and Bit Flip Register 24 */
#define MTU_MC12_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061C90u)

/** \brief C92, Read Data and Bit Flip Register 25 */
#define MTU_MC12_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061C92u)

/** \brief C94, Read Data and Bit Flip Register 26 */
#define MTU_MC12_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061C94u)

/** \brief C96, Read Data and Bit Flip Register 27 */
#define MTU_MC12_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061C96u)

/** \brief C98, Read Data and Bit Flip Register 28 */
#define MTU_MC12_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061C98u)

/** \brief C9A, Read Data and Bit Flip Register 29 */
#define MTU_MC12_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061C9Au)

/** \brief C9C, Read Data and Bit Flip Register 30 */
#define MTU_MC12_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061C9Cu)

/** \brief C9E, Read Data and Bit Flip Register 31 */
#define MTU_MC12_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061C9Eu)

/** \brief CA0, Read Data and Bit Flip Register 32 */
#define MTU_MC12_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061CA0u)

/** \brief CA2, Read Data and Bit Flip Register 33 */
#define MTU_MC12_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061CA2u)

/** \brief CA4, Read Data and Bit Flip Register 34 */
#define MTU_MC12_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061CA4u)

/** \brief CA6, Read Data and Bit Flip Register 35 */
#define MTU_MC12_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061CA6u)

/** \brief CA8, Read Data and Bit Flip Register 36 */
#define MTU_MC12_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061CA8u)

/** \brief CAA, Read Data and Bit Flip Register 37 */
#define MTU_MC12_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061CAAu)

/** \brief CAC, Read Data and Bit Flip Register 38 */
#define MTU_MC12_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061CACu)

/** \brief CAE, Read Data and Bit Flip Register 39 */
#define MTU_MC12_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061CAEu)

/** \brief CB0, Read Data and Bit Flip Register 40 */
#define MTU_MC12_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061CB0u)

/** \brief CB2, Read Data and Bit Flip Register 41 */
#define MTU_MC12_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061CB2u)

/** \brief CB4, Read Data and Bit Flip Register 42 */
#define MTU_MC12_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061CB4u)

/** \brief CB6, Read Data and Bit Flip Register 43 */
#define MTU_MC12_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061CB6u)

/** \brief CB8, Read Data and Bit Flip Register 44 */
#define MTU_MC12_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061CB8u)

/** \brief CBA, Read Data and Bit Flip Register 45 */
#define MTU_MC12_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061CBAu)

/** \brief CBC, Read Data and Bit Flip Register 46 */
#define MTU_MC12_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061CBCu)

/** \brief CBE, Read Data and Bit Flip Register 47 */
#define MTU_MC12_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061CBEu)

/** \brief CC0, Read Data and Bit Flip Register 48 */
#define MTU_MC12_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061CC0u)

/** \brief CC2, Read Data and Bit Flip Register 49 */
#define MTU_MC12_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061CC2u)

/** \brief CC4, Read Data and Bit Flip Register 50 */
#define MTU_MC12_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061CC4u)

/** \brief CC6, Read Data and Bit Flip Register 51 */
#define MTU_MC12_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061CC6u)

/** \brief CC8, Read Data and Bit Flip Register 52 */
#define MTU_MC12_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061CC8u)

/** \brief CCA, Read Data and Bit Flip Register 53 */
#define MTU_MC12_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061CCAu)

/** \brief CCC, Read Data and Bit Flip Register 54 */
#define MTU_MC12_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061CCCu)

