HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxMtu_reg.h
/** \brief F9E, Read Data and Bit Flip Register 31 */
#define MTU_MC15_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061F9Eu)

/** \brief FA0, Read Data and Bit Flip Register 32 */
#define MTU_MC15_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FA0u)

/** \brief FA2, Read Data and Bit Flip Register 33 */
#define MTU_MC15_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FA2u)

/** \brief FA4, Read Data and Bit Flip Register 34 */
#define MTU_MC15_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FA4u)

/** \brief FA6, Read Data and Bit Flip Register 35 */
#define MTU_MC15_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FA6u)

/** \brief FA8, Read Data and Bit Flip Register 36 */
#define MTU_MC15_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FA8u)

/** \brief FAA, Read Data and Bit Flip Register 37 */
#define MTU_MC15_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FAAu)

/** \brief FAC, Read Data and Bit Flip Register 38 */
#define MTU_MC15_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FACu)

/** \brief FAE, Read Data and Bit Flip Register 39 */
#define MTU_MC15_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FAEu)

/** \brief FB0, Read Data and Bit Flip Register 40 */
#define MTU_MC15_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FB0u)

/** \brief FB2, Read Data and Bit Flip Register 41 */
#define MTU_MC15_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FB2u)

/** \brief FB4, Read Data and Bit Flip Register 42 */
#define MTU_MC15_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FB4u)

/** \brief FB6, Read Data and Bit Flip Register 43 */
#define MTU_MC15_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FB6u)

/** \brief FB8, Read Data and Bit Flip Register 44 */
#define MTU_MC15_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FB8u)

/** \brief FBA, Read Data and Bit Flip Register 45 */
#define MTU_MC15_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FBAu)

/** \brief FBC, Read Data and Bit Flip Register 46 */
#define MTU_MC15_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FBCu)

/** \brief FBE, Read Data and Bit Flip Register 47 */
#define MTU_MC15_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FBEu)

/** \brief FC0, Read Data and Bit Flip Register 48 */
#define MTU_MC15_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FC0u)

/** \brief FC2, Read Data and Bit Flip Register 49 */
#define MTU_MC15_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FC2u)

/** \brief FC4, Read Data and Bit Flip Register 50 */
#define MTU_MC15_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FC4u)

/** \brief FC6, Read Data and Bit Flip Register 51 */
#define MTU_MC15_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FC6u)

/** \brief FC8, Read Data and Bit Flip Register 52 */
#define MTU_MC15_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FC8u)

/** \brief FCA, Read Data and Bit Flip Register 53 */
#define MTU_MC15_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FCAu)

/** \brief FCC, Read Data and Bit Flip Register 54 */
#define MTU_MC15_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FCCu)

/** \brief FCE, Read Data and Bit Flip Register 55 */
#define MTU_MC15_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FCEu)

/** \brief FD0, Read Data and Bit Flip Register 56 */
#define MTU_MC15_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FD0u)

/** \brief FD2, Read Data and Bit Flip Register 57 */
#define MTU_MC15_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FD2u)

/** \brief FD4, Read Data and Bit Flip Register 58 */
#define MTU_MC15_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FD4u)

/** \brief FD6, Read Data and Bit Flip Register 59 */
#define MTU_MC15_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FD6u)

/** \brief FD8, Read Data and Bit Flip Register 60 */
#define MTU_MC15_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FD8u)

/** \brief FDA, Read Data and Bit Flip Register 61 */
#define MTU_MC15_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FDAu)

/** \brief FDC, Read Data and Bit Flip Register 62 */
#define MTU_MC15_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FDCu)

/** \brief FDE, Read Data and Bit Flip Register 63 */
#define MTU_MC15_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FDEu)

/** \brief FE0, Read Data and Bit Flip Register 64 */
#define MTU_MC15_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FE0u)

/** \brief FE2, Read Data and Bit Flip Register 65 */
#define MTU_MC15_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FE2u)

/** \brief FE4, Read Data and Bit Flip Register 66 */
#define MTU_MC15_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061FE4u)

/** \brief FEE, Alarm Sources Configuration Register */
#define MTU_MC15_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF0061FEEu)

/** \brief FF0, SSH Safety Faults Status Register  */
#define MTU_MC15_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF0061FF0u)

/** \brief FF2, Error Information Register 0 */
#define MTU_MC15_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0061FF2u)

/** \brief FF4, Error Information Register 1 */
#define MTU_MC15_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0061FF4u)

/** \brief FF6, Error Information Register 2 */
#define MTU_MC15_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0061FF6u)

/** \brief FF8, Error Information Register 3 */
#define MTU_MC15_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0061FF8u)

