HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxMtu_reg.h
/** \brief 10A0, Read Data and Bit Flip Register 32 */
#define MTU_MC16_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00620A0u)

/** \brief 10A2, Read Data and Bit Flip Register 33 */
#define MTU_MC16_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00620A2u)

/** \brief 10A4, Read Data and Bit Flip Register 34 */
#define MTU_MC16_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00620A4u)

/** \brief 10A6, Read Data and Bit Flip Register 35 */
#define MTU_MC16_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00620A6u)

/** \brief 10A8, Read Data and Bit Flip Register 36 */
#define MTU_MC16_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00620A8u)

/** \brief 10AA, Read Data and Bit Flip Register 37 */
#define MTU_MC16_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00620AAu)

/** \brief 10AC, Read Data and Bit Flip Register 38 */
#define MTU_MC16_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00620ACu)

/** \brief 10AE, Read Data and Bit Flip Register 39 */
#define MTU_MC16_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00620AEu)

/** \brief 10B0, Read Data and Bit Flip Register 40 */
#define MTU_MC16_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00620B0u)

/** \brief 10B2, Read Data and Bit Flip Register 41 */
#define MTU_MC16_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00620B2u)

/** \brief 10B4, Read Data and Bit Flip Register 42 */
#define MTU_MC16_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00620B4u)

/** \brief 10B6, Read Data and Bit Flip Register 43 */
#define MTU_MC16_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00620B6u)

/** \brief 10B8, Read Data and Bit Flip Register 44 */
#define MTU_MC16_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00620B8u)

/** \brief 10BA, Read Data and Bit Flip Register 45 */
#define MTU_MC16_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00620BAu)

/** \brief 10BC, Read Data and Bit Flip Register 46 */
#define MTU_MC16_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00620BCu)

/** \brief 10BE, Read Data and Bit Flip Register 47 */
#define MTU_MC16_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00620BEu)

/** \brief 10C0, Read Data and Bit Flip Register 48 */
#define MTU_MC16_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00620C0u)

/** \brief 10C2, Read Data and Bit Flip Register 49 */
#define MTU_MC16_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00620C2u)

/** \brief 10C4, Read Data and Bit Flip Register 50 */
#define MTU_MC16_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00620C4u)

/** \brief 10C6, Read Data and Bit Flip Register 51 */
#define MTU_MC16_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00620C6u)

/** \brief 10C8, Read Data and Bit Flip Register 52 */
#define MTU_MC16_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00620C8u)

/** \brief 10CA, Read Data and Bit Flip Register 53 */
#define MTU_MC16_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00620CAu)

/** \brief 10CC, Read Data and Bit Flip Register 54 */
#define MTU_MC16_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00620CCu)

/** \brief 10CE, Read Data and Bit Flip Register 55 */
#define MTU_MC16_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00620CEu)

/** \brief 10D0, Read Data and Bit Flip Register 56 */
#define MTU_MC16_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00620D0u)

/** \brief 10D2, Read Data and Bit Flip Register 57 */
#define MTU_MC16_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00620D2u)

/** \brief 10D4, Read Data and Bit Flip Register 58 */
#define MTU_MC16_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00620D4u)

/** \brief 10D6, Read Data and Bit Flip Register 59 */
#define MTU_MC16_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00620D6u)

/** \brief 10D8, Read Data and Bit Flip Register 60 */
#define MTU_MC16_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00620D8u)

/** \brief 10DA, Read Data and Bit Flip Register 61 */
#define MTU_MC16_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00620DAu)

/** \brief 10DC, Read Data and Bit Flip Register 62 */
#define MTU_MC16_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00620DCu)

/** \brief 10DE, Read Data and Bit Flip Register 63 */
#define MTU_MC16_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00620DEu)

/** \brief 10E0, Read Data and Bit Flip Register 64 */
#define MTU_MC16_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00620E0u)

/** \brief 10E2, Read Data and Bit Flip Register 65 */
#define MTU_MC16_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00620E2u)

/** \brief 10E4, Read Data and Bit Flip Register 66 */
#define MTU_MC16_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00620E4u)

/** \brief 10EE, Alarm Sources Configuration Register */
#define MTU_MC16_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF00620EEu)

/** \brief 10F0, SSH Safety Faults Status Register  */
#define MTU_MC16_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF00620F0u)

/** \brief 10F2, Error Information Register 0 */
#define MTU_MC16_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00620F2u)

/** \brief 10F4, Error Information Register 1 */
#define MTU_MC16_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00620F4u)

/** \brief 10F6, Error Information Register 2 */
#define MTU_MC16_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00620F6u)

/** \brief 10F8, Error Information Register 3 */
#define MTU_MC16_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00620F8u)

