HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxMtu_reg.h
/** \brief 2E76, Read Data and Bit Flip Register 11 */
#define MTU_MC46_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063E76u)

/** \brief 2E78, Read Data and Bit Flip Register 12 */
#define MTU_MC46_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063E78u)

/** \brief 2E7A, Read Data and Bit Flip Register 13 */
#define MTU_MC46_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063E7Au)

/** \brief 2E7C, Read Data and Bit Flip Register 14 */
#define MTU_MC46_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063E7Cu)

/** \brief 2E7E, Read Data and Bit Flip Register 15 */
#define MTU_MC46_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063E7Eu)

/** \brief 2E80, Read Data and Bit Flip Register 16 */
#define MTU_MC46_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063E80u)

/** \brief 2E82, Read Data and Bit Flip Register 17 */
#define MTU_MC46_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063E82u)

/** \brief 2E84, Read Data and Bit Flip Register 18 */
#define MTU_MC46_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063E84u)

/** \brief 2E86, Read Data and Bit Flip Register 19 */
#define MTU_MC46_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063E86u)

/** \brief 2E88, Read Data and Bit Flip Register 20 */
#define MTU_MC46_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063E88u)

/** \brief 2E8A, Read Data and Bit Flip Register 21 */
#define MTU_MC46_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063E8Au)

/** \brief 2E8C, Read Data and Bit Flip Register 22 */
#define MTU_MC46_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063E8Cu)

/** \brief 2E8E, Read Data and Bit Flip Register 23 */
#define MTU_MC46_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063E8Eu)

/** \brief 2E90, Read Data and Bit Flip Register 24 */
#define MTU_MC46_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063E90u)

/** \brief 2E92, Read Data and Bit Flip Register 25 */
#define MTU_MC46_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063E92u)

/** \brief 2E94, Read Data and Bit Flip Register 26 */
#define MTU_MC46_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063E94u)

/** \brief 2E96, Read Data and Bit Flip Register 27 */
#define MTU_MC46_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063E96u)

/** \brief 2E98, Read Data and Bit Flip Register 28 */
#define MTU_MC46_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063E98u)

/** \brief 2E9A, Read Data and Bit Flip Register 29 */
#define MTU_MC46_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063E9Au)

/** \brief 2E9C, Read Data and Bit Flip Register 30 */
#define MTU_MC46_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063E9Cu)

/** \brief 2E9E, Read Data and Bit Flip Register 31 */
#define MTU_MC46_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063E9Eu)

/** \brief 2EA0, Read Data and Bit Flip Register 32 */
#define MTU_MC46_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063EA0u)

/** \brief 2EA2, Read Data and Bit Flip Register 33 */
#define MTU_MC46_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063EA2u)

/** \brief 2EA4, Read Data and Bit Flip Register 34 */
#define MTU_MC46_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063EA4u)

/** \brief 2EA6, Read Data and Bit Flip Register 35 */
#define MTU_MC46_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063EA6u)

/** \brief 2EA8, Read Data and Bit Flip Register 36 */
#define MTU_MC46_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063EA8u)

/** \brief 2EAA, Read Data and Bit Flip Register 37 */
#define MTU_MC46_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063EAAu)

/** \brief 2EAC, Read Data and Bit Flip Register 38 */
#define MTU_MC46_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063EACu)

/** \brief 2EAE, Read Data and Bit Flip Register 39 */
#define MTU_MC46_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063EAEu)

/** \brief 2EB0, Read Data and Bit Flip Register 40 */
#define MTU_MC46_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063EB0u)

/** \brief 2EB2, Read Data and Bit Flip Register 41 */
#define MTU_MC46_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063EB2u)

/** \brief 2EB4, Read Data and Bit Flip Register 42 */
#define MTU_MC46_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063EB4u)

/** \brief 2EB6, Read Data and Bit Flip Register 43 */
#define MTU_MC46_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063EB6u)

/** \brief 2EB8, Read Data and Bit Flip Register 44 */
#define MTU_MC46_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063EB8u)

/** \brief 2EBA, Read Data and Bit Flip Register 45 */
#define MTU_MC46_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063EBAu)

/** \brief 2EBC, Read Data and Bit Flip Register 46 */
#define MTU_MC46_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063EBCu)

/** \brief 2EBE, Read Data and Bit Flip Register 47 */
#define MTU_MC46_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063EBEu)

/** \brief 2EC0, Read Data and Bit Flip Register 48 */
#define MTU_MC46_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063EC0u)

/** \brief 2EC2, Read Data and Bit Flip Register 49 */
#define MTU_MC46_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063EC2u)

/** \brief 2EC4, Read Data and Bit Flip Register 50 */
#define MTU_MC46_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063EC4u)

/** \brief 2EC6, Read Data and Bit Flip Register 51 */
#define MTU_MC46_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063EC6u)

/** \brief 2EC8, Read Data and Bit Flip Register 52 */
#define MTU_MC46_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063EC8u)

/** \brief 2ECA, Read Data and Bit Flip Register 53 */
#define MTU_MC46_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063ECAu)

