HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxMtu_reg.h
/** \brief 32CE, Read Data and Bit Flip Register 55 */
#define MTU_MC50_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642CEu)

/** \brief 32D0, Read Data and Bit Flip Register 56 */
#define MTU_MC50_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642D0u)

/** \brief 32D2, Read Data and Bit Flip Register 57 */
#define MTU_MC50_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642D2u)

/** \brief 32D4, Read Data and Bit Flip Register 58 */
#define MTU_MC50_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642D4u)

/** \brief 32D6, Read Data and Bit Flip Register 59 */
#define MTU_MC50_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642D6u)

/** \brief 32D8, Read Data and Bit Flip Register 60 */
#define MTU_MC50_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642D8u)

/** \brief 32DA, Read Data and Bit Flip Register 61 */
#define MTU_MC50_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642DAu)

/** \brief 32DC, Read Data and Bit Flip Register 62 */
#define MTU_MC50_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642DCu)

/** \brief 32DE, Read Data and Bit Flip Register 63 */
#define MTU_MC50_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642DEu)

/** \brief 32E0, Read Data and Bit Flip Register 64 */
#define MTU_MC50_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642E0u)

/** \brief 32E2, Read Data and Bit Flip Register 65 */
#define MTU_MC50_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642E2u)

/** \brief 32E4, Read Data and Bit Flip Register 66 */
#define MTU_MC50_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00642E4u)

/** \brief 32EE, Alarm Sources Configuration Register */
#define MTU_MC50_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF00642EEu)

/** \brief 32F0, SSH Safety Faults Status Register  */
#define MTU_MC50_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF00642F0u)

/** \brief 32F2, Error Information Register 0 */
#define MTU_MC50_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00642F2u)

/** \brief 32F4, Error Information Register 1 */
#define MTU_MC50_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00642F4u)

/** \brief 32F6, Error Information Register 2 */
#define MTU_MC50_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00642F6u)

/** \brief 32F8, Error Information Register 3 */
#define MTU_MC50_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00642F8u)

/** \brief 32FA, Error Information Register 4 */
#define MTU_MC50_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00642FAu)

/** \brief 3300, Configuration Registers */
#define MTU_MC51_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0064300u)

/** \brief 3302, Configuration Register 1 */
#define MTU_MC51_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0064302u)

/** \brief 3304, MBIST Control Register */
#define MTU_MC51_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0064304u)

/** \brief 3306, Status Register */
#define MTU_MC51_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0064306u)

/** \brief 3308, Range Register, single address mode */
#define MTU_MC51_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0064308u)

/** \brief 330C, Revision ID Register */
#define MTU_MC51_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006430Cu)

/** \brief 330E, ECC Safety Register */
#define MTU_MC51_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006430Eu)

/** \brief 3310, Memory ECC Detection Register */
#define MTU_MC51_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0064310u)

/** \brief 3312, Error Tracking Register 0 */
#define MTU_MC51_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064312u)

/** \brief 3314, Error Tracking Register 1 */
#define MTU_MC51_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064314u)

/** \brief 3316, Error Tracking Register 2 */
#define MTU_MC51_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064316u)

/** \brief 3318, Error Tracking Register 3 */
#define MTU_MC51_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064318u)

/** \brief 331A, Error Tracking Register 4 */
#define MTU_MC51_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006431Au)

/** \brief 3360, Read Data and Bit Flip Register 0 */
#define MTU_MC51_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064360u)

/** \brief 3362, Read Data and Bit Flip Register 1 */
#define MTU_MC51_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064362u)

/** \brief 3364, Read Data and Bit Flip Register 2 */
#define MTU_MC51_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064364u)

/** \brief 3366, Read Data and Bit Flip Register 3 */
#define MTU_MC51_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064366u)

/** \brief 3368, Read Data and Bit Flip Register 4 */
#define MTU_MC51_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064368u)

/** \brief 336A, Read Data and Bit Flip Register 5 */
#define MTU_MC51_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006436Au)

/** \brief 336C, Read Data and Bit Flip Register 6 */
#define MTU_MC51_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006436Cu)

/** \brief 336E, Read Data and Bit Flip Register 7 */
#define MTU_MC51_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006436Eu)

/** \brief 3370, Read Data and Bit Flip Register 8 */
#define MTU_MC51_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064370u)

/** \brief 3372, Read Data and Bit Flip Register 9 */
#define MTU_MC51_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064372u)

/** \brief 3374, Read Data and Bit Flip Register 10 */
#define MTU_MC51_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064374u)

/** \brief 3376, Read Data and Bit Flip Register 11 */
#define MTU_MC51_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064376u)

/** \brief 3378, Read Data and Bit Flip Register 12 */
#define MTU_MC51_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064378u)

/** \brief 337A, Read Data and Bit Flip Register 13 */
#define MTU_MC51_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006437Au)

