HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxMtu_reg.h
/** \brief 38B8, Read Data and Bit Flip Register 44 */
#define MTU_MC56_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648B8u)

/** \brief 38BA, Read Data and Bit Flip Register 45 */
#define MTU_MC56_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648BAu)

/** \brief 38BC, Read Data and Bit Flip Register 46 */
#define MTU_MC56_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648BCu)

/** \brief 38BE, Read Data and Bit Flip Register 47 */
#define MTU_MC56_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648BEu)

/** \brief 38C0, Read Data and Bit Flip Register 48 */
#define MTU_MC56_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648C0u)

/** \brief 38C2, Read Data and Bit Flip Register 49 */
#define MTU_MC56_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648C2u)

/** \brief 38C4, Read Data and Bit Flip Register 50 */
#define MTU_MC56_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648C4u)

/** \brief 38C6, Read Data and Bit Flip Register 51 */
#define MTU_MC56_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648C6u)

/** \brief 38C8, Read Data and Bit Flip Register 52 */
#define MTU_MC56_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648C8u)

/** \brief 38CA, Read Data and Bit Flip Register 53 */
#define MTU_MC56_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648CAu)

/** \brief 38CC, Read Data and Bit Flip Register 54 */
#define MTU_MC56_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648CCu)

/** \brief 38CE, Read Data and Bit Flip Register 55 */
#define MTU_MC56_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648CEu)

/** \brief 38D0, Read Data and Bit Flip Register 56 */
#define MTU_MC56_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648D0u)

/** \brief 38D2, Read Data and Bit Flip Register 57 */
#define MTU_MC56_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648D2u)

/** \brief 38D4, Read Data and Bit Flip Register 58 */
#define MTU_MC56_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648D4u)

/** \brief 38D6, Read Data and Bit Flip Register 59 */
#define MTU_MC56_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648D6u)

/** \brief 38D8, Read Data and Bit Flip Register 60 */
#define MTU_MC56_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648D8u)

/** \brief 38DA, Read Data and Bit Flip Register 61 */
#define MTU_MC56_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648DAu)

/** \brief 38DC, Read Data and Bit Flip Register 62 */
#define MTU_MC56_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648DCu)

/** \brief 38DE, Read Data and Bit Flip Register 63 */
#define MTU_MC56_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648DEu)

/** \brief 38E0, Read Data and Bit Flip Register 64 */
#define MTU_MC56_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648E0u)

/** \brief 38E2, Read Data and Bit Flip Register 65 */
#define MTU_MC56_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648E2u)

/** \brief 38E4, Read Data and Bit Flip Register 66 */
#define MTU_MC56_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00648E4u)

/** \brief 38EE, Alarm Sources Configuration Register */
#define MTU_MC56_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF00648EEu)

/** \brief 38F0, SSH Safety Faults Status Register  */
#define MTU_MC56_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF00648F0u)

/** \brief 38F2, Error Information Register 0 */
#define MTU_MC56_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00648F2u)

/** \brief 38F4, Error Information Register 1 */
#define MTU_MC56_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00648F4u)

/** \brief 38F6, Error Information Register 2 */
#define MTU_MC56_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00648F6u)

/** \brief 38F8, Error Information Register 3 */
#define MTU_MC56_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00648F8u)

/** \brief 38FA, Error Information Register 4 */
#define MTU_MC56_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00648FAu)

/** \brief 3900, Configuration Registers */
#define MTU_MC57_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0064900u)

/** \brief 3902, Configuration Register 1 */
#define MTU_MC57_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0064902u)

/** \brief 3904, MBIST Control Register */
#define MTU_MC57_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0064904u)

/** \brief 3906, Status Register */
#define MTU_MC57_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0064906u)

/** \brief 3908, Range Register, single address mode */
#define MTU_MC57_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0064908u)

/** \brief 390C, Revision ID Register */
#define MTU_MC57_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006490Cu)

/** \brief 390E, ECC Safety Register */
#define MTU_MC57_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006490Eu)

/** \brief 3910, Memory ECC Detection Register */
#define MTU_MC57_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0064910u)

/** \brief 3912, Error Tracking Register 0 */
#define MTU_MC57_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064912u)

/** \brief 3914, Error Tracking Register 1 */
#define MTU_MC57_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064914u)

/** \brief 3916, Error Tracking Register 2 */
#define MTU_MC57_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064916u)

/** \brief 3918, Error Tracking Register 3 */
#define MTU_MC57_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064918u)

/** \brief 391A, Error Tracking Register 4 */
#define MTU_MC57_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006491Au)

