HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxMtu_reg.h
/** \brief 49F0, SSH Safety Faults Status Register  */
#define MTU_MC73_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF00659F0u)

/** \brief 49F2, Error Information Register 0 */
#define MTU_MC73_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00659F2u)

/** \brief 49F4, Error Information Register 1 */
#define MTU_MC73_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00659F4u)

/** \brief 49F6, Error Information Register 2 */
#define MTU_MC73_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00659F6u)

/** \brief 49F8, Error Information Register 3 */
#define MTU_MC73_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00659F8u)

/** \brief 49FA, Error Information Register 4 */
#define MTU_MC73_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00659FAu)

/** \brief 4A00, Configuration Registers */
#define MTU_MC74_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0065A00u)

/** \brief 4A02, Configuration Register 1 */
#define MTU_MC74_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0065A02u)

/** \brief 4A04, MBIST Control Register */
#define MTU_MC74_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0065A04u)

/** \brief 4A06, Status Register */
#define MTU_MC74_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0065A06u)

/** \brief 4A08, Range Register, single address mode */
#define MTU_MC74_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0065A08u)

/** \brief 4A0C, Revision ID Register */
#define MTU_MC74_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF0065A0Cu)

/** \brief 4A0E, ECC Safety Register */
#define MTU_MC74_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF0065A0Eu)

/** \brief 4A10, Memory ECC Detection Register */
#define MTU_MC74_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0065A10u)

/** \brief 4A12, Error Tracking Register 0 */
#define MTU_MC74_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065A12u)

/** \brief 4A14, Error Tracking Register 1 */
#define MTU_MC74_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065A14u)

/** \brief 4A16, Error Tracking Register 2 */
#define MTU_MC74_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065A16u)

/** \brief 4A18, Error Tracking Register 3 */
#define MTU_MC74_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065A18u)

/** \brief 4A1A, Error Tracking Register 4 */
#define MTU_MC74_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065A1Au)

/** \brief 4A60, Read Data and Bit Flip Register 0 */
#define MTU_MC74_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065A60u)

/** \brief 4A62, Read Data and Bit Flip Register 1 */
#define MTU_MC74_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065A62u)

/** \brief 4A64, Read Data and Bit Flip Register 2 */
#define MTU_MC74_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065A64u)

/** \brief 4A66, Read Data and Bit Flip Register 3 */
#define MTU_MC74_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065A66u)

/** \brief 4A68, Read Data and Bit Flip Register 4 */
#define MTU_MC74_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065A68u)

/** \brief 4A6A, Read Data and Bit Flip Register 5 */
#define MTU_MC74_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065A6Au)

/** \brief 4A6C, Read Data and Bit Flip Register 6 */
#define MTU_MC74_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065A6Cu)

/** \brief 4A6E, Read Data and Bit Flip Register 7 */
#define MTU_MC74_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065A6Eu)

/** \brief 4A70, Read Data and Bit Flip Register 8 */
#define MTU_MC74_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065A70u)

/** \brief 4A72, Read Data and Bit Flip Register 9 */
#define MTU_MC74_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065A72u)

/** \brief 4A74, Read Data and Bit Flip Register 10 */
#define MTU_MC74_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065A74u)

/** \brief 4A76, Read Data and Bit Flip Register 11 */
#define MTU_MC74_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065A76u)

/** \brief 4A78, Read Data and Bit Flip Register 12 */
#define MTU_MC74_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065A78u)

/** \brief 4A7A, Read Data and Bit Flip Register 13 */
#define MTU_MC74_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065A7Au)

/** \brief 4A7C, Read Data and Bit Flip Register 14 */
#define MTU_MC74_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065A7Cu)

/** \brief 4A7E, Read Data and Bit Flip Register 15 */
#define MTU_MC74_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065A7Eu)

/** \brief 4A80, Read Data and Bit Flip Register 16 */
#define MTU_MC74_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065A80u)

/** \brief 4A82, Read Data and Bit Flip Register 17 */
#define MTU_MC74_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065A82u)

/** \brief 4A84, Read Data and Bit Flip Register 18 */
#define MTU_MC74_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065A84u)

/** \brief 4A86, Read Data and Bit Flip Register 19 */
#define MTU_MC74_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065A86u)

/** \brief 4A88, Read Data and Bit Flip Register 20 */
#define MTU_MC74_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065A88u)

/** \brief 4A8A, Read Data and Bit Flip Register 21 */
#define MTU_MC74_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065A8Au)

/** \brief 4A8C, Read Data and Bit Flip Register 22 */
#define MTU_MC74_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065A8Cu)

/** \brief 4A8E, Read Data and Bit Flip Register 23 */
#define MTU_MC74_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065A8Eu)

/** \brief 4A90, Read Data and Bit Flip Register 24 */
#define MTU_MC74_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065A90u)

/** \brief 4A92, Read Data and Bit Flip Register 25 */
#define MTU_MC74_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065A92u)

/** \brief 4A94, Read Data and Bit Flip Register 26 */
#define MTU_MC74_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065A94u)

/** \brief 4A96, Read Data and Bit Flip Register 27 */
#define MTU_MC74_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065A96u)

