HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxMtu_reg.h
/** \brief 4E02, Configuration Register 1 */
#define MTU_MC78_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0065E02u)

/** \brief 4E04, MBIST Control Register */
#define MTU_MC78_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0065E04u)

/** \brief 4E06, Status Register */
#define MTU_MC78_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0065E06u)

/** \brief 4E08, Range Register, single address mode */
#define MTU_MC78_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0065E08u)

/** \brief 4E0C, Revision ID Register */
#define MTU_MC78_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF0065E0Cu)

/** \brief 4E0E, ECC Safety Register */
#define MTU_MC78_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF0065E0Eu)

/** \brief 4E10, Memory ECC Detection Register */
#define MTU_MC78_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0065E10u)

/** \brief 4E12, Error Tracking Register 0 */
#define MTU_MC78_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065E12u)

/** \brief 4E14, Error Tracking Register 1 */
#define MTU_MC78_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065E14u)

/** \brief 4E16, Error Tracking Register 2 */
#define MTU_MC78_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065E16u)

/** \brief 4E18, Error Tracking Register 3 */
#define MTU_MC78_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065E18u)

/** \brief 4E1A, Error Tracking Register 4 */
#define MTU_MC78_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065E1Au)

/** \brief 4E60, Read Data and Bit Flip Register 0 */
#define MTU_MC78_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065E60u)

/** \brief 4E62, Read Data and Bit Flip Register 1 */
#define MTU_MC78_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065E62u)

/** \brief 4E64, Read Data and Bit Flip Register 2 */
#define MTU_MC78_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065E64u)

/** \brief 4E66, Read Data and Bit Flip Register 3 */
#define MTU_MC78_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065E66u)

/** \brief 4E68, Read Data and Bit Flip Register 4 */
#define MTU_MC78_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065E68u)

/** \brief 4E6A, Read Data and Bit Flip Register 5 */
#define MTU_MC78_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065E6Au)

/** \brief 4E6C, Read Data and Bit Flip Register 6 */
#define MTU_MC78_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065E6Cu)

/** \brief 4E6E, Read Data and Bit Flip Register 7 */
#define MTU_MC78_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065E6Eu)

/** \brief 4E70, Read Data and Bit Flip Register 8 */
#define MTU_MC78_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065E70u)

/** \brief 4E72, Read Data and Bit Flip Register 9 */
#define MTU_MC78_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065E72u)

/** \brief 4E74, Read Data and Bit Flip Register 10 */
#define MTU_MC78_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065E74u)

/** \brief 4E76, Read Data and Bit Flip Register 11 */
#define MTU_MC78_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065E76u)

/** \brief 4E78, Read Data and Bit Flip Register 12 */
#define MTU_MC78_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065E78u)

/** \brief 4E7A, Read Data and Bit Flip Register 13 */
#define MTU_MC78_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065E7Au)

/** \brief 4E7C, Read Data and Bit Flip Register 14 */
#define MTU_MC78_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065E7Cu)

/** \brief 4E7E, Read Data and Bit Flip Register 15 */
#define MTU_MC78_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065E7Eu)

/** \brief 4E80, Read Data and Bit Flip Register 16 */
#define MTU_MC78_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065E80u)

/** \brief 4E82, Read Data and Bit Flip Register 17 */
#define MTU_MC78_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065E82u)

/** \brief 4E84, Read Data and Bit Flip Register 18 */
#define MTU_MC78_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065E84u)

/** \brief 4E86, Read Data and Bit Flip Register 19 */
#define MTU_MC78_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065E86u)

/** \brief 4E88, Read Data and Bit Flip Register 20 */
#define MTU_MC78_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065E88u)

/** \brief 4E8A, Read Data and Bit Flip Register 21 */
#define MTU_MC78_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065E8Au)

/** \brief 4E8C, Read Data and Bit Flip Register 22 */
#define MTU_MC78_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065E8Cu)

/** \brief 4E8E, Read Data and Bit Flip Register 23 */
#define MTU_MC78_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065E8Eu)

/** \brief 4E90, Read Data and Bit Flip Register 24 */
#define MTU_MC78_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065E90u)

/** \brief 4E92, Read Data and Bit Flip Register 25 */
#define MTU_MC78_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065E92u)

/** \brief 4E94, Read Data and Bit Flip Register 26 */
#define MTU_MC78_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065E94u)

/** \brief 4E96, Read Data and Bit Flip Register 27 */
#define MTU_MC78_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065E96u)

/** \brief 4E98, Read Data and Bit Flip Register 28 */
#define MTU_MC78_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065E98u)

/** \brief 4E9A, Read Data and Bit Flip Register 29 */
#define MTU_MC78_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065E9Au)

/** \brief 4E9C, Read Data and Bit Flip Register 30 */
#define MTU_MC78_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065E9Cu)

/** \brief 4E9E, Read Data and Bit Flip Register 31 */
#define MTU_MC78_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065E9Eu)

/** \brief 4EA0, Read Data and Bit Flip Register 32 */
#define MTU_MC78_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065EA0u)

/** \brief 4EA2, Read Data and Bit Flip Register 33 */
#define MTU_MC78_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065EA2u)

/** \brief 4EA4, Read Data and Bit Flip Register 34 */
#define MTU_MC78_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065EA4u)

