HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxMtu_reg.h
/** \brief 50A6, Read Data and Bit Flip Register 35 */
#define MTU_MC80_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660A6u)

/** \brief 50A8, Read Data and Bit Flip Register 36 */
#define MTU_MC80_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660A8u)

/** \brief 50AA, Read Data and Bit Flip Register 37 */
#define MTU_MC80_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660AAu)

/** \brief 50AC, Read Data and Bit Flip Register 38 */
#define MTU_MC80_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660ACu)

/** \brief 50AE, Read Data and Bit Flip Register 39 */
#define MTU_MC80_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660AEu)

/** \brief 50B0, Read Data and Bit Flip Register 40 */
#define MTU_MC80_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660B0u)

/** \brief 50B2, Read Data and Bit Flip Register 41 */
#define MTU_MC80_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660B2u)

/** \brief 50B4, Read Data and Bit Flip Register 42 */
#define MTU_MC80_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660B4u)

/** \brief 50B6, Read Data and Bit Flip Register 43 */
#define MTU_MC80_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660B6u)

/** \brief 50B8, Read Data and Bit Flip Register 44 */
#define MTU_MC80_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660B8u)

/** \brief 50BA, Read Data and Bit Flip Register 45 */
#define MTU_MC80_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660BAu)

/** \brief 50BC, Read Data and Bit Flip Register 46 */
#define MTU_MC80_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660BCu)

/** \brief 50BE, Read Data and Bit Flip Register 47 */
#define MTU_MC80_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660BEu)

/** \brief 50C0, Read Data and Bit Flip Register 48 */
#define MTU_MC80_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660C0u)

/** \brief 50C2, Read Data and Bit Flip Register 49 */
#define MTU_MC80_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660C2u)

/** \brief 50C4, Read Data and Bit Flip Register 50 */
#define MTU_MC80_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660C4u)

/** \brief 50C6, Read Data and Bit Flip Register 51 */
#define MTU_MC80_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660C6u)

/** \brief 50C8, Read Data and Bit Flip Register 52 */
#define MTU_MC80_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660C8u)

/** \brief 50CA, Read Data and Bit Flip Register 53 */
#define MTU_MC80_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660CAu)

/** \brief 50CC, Read Data and Bit Flip Register 54 */
#define MTU_MC80_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660CCu)

/** \brief 50CE, Read Data and Bit Flip Register 55 */
#define MTU_MC80_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660CEu)

/** \brief 50D0, Read Data and Bit Flip Register 56 */
#define MTU_MC80_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660D0u)

/** \brief 50D2, Read Data and Bit Flip Register 57 */
#define MTU_MC80_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660D2u)

/** \brief 50D4, Read Data and Bit Flip Register 58 */
#define MTU_MC80_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660D4u)

/** \brief 50D6, Read Data and Bit Flip Register 59 */
#define MTU_MC80_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660D6u)

/** \brief 50D8, Read Data and Bit Flip Register 60 */
#define MTU_MC80_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660D8u)

/** \brief 50DA, Read Data and Bit Flip Register 61 */
#define MTU_MC80_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660DAu)

/** \brief 50DC, Read Data and Bit Flip Register 62 */
#define MTU_MC80_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660DCu)

/** \brief 50DE, Read Data and Bit Flip Register 63 */
#define MTU_MC80_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660DEu)

/** \brief 50E0, Read Data and Bit Flip Register 64 */
#define MTU_MC80_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660E0u)

/** \brief 50E2, Read Data and Bit Flip Register 65 */
#define MTU_MC80_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660E2u)

/** \brief 50E4, Read Data and Bit Flip Register 66 */
#define MTU_MC80_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00660E4u)

/** \brief 50EE, Alarm Sources Configuration Register */
#define MTU_MC80_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF00660EEu)

/** \brief 50F0, SSH Safety Faults Status Register  */
#define MTU_MC80_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF00660F0u)

/** \brief 50F2, Error Information Register 0 */
#define MTU_MC80_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00660F2u)

/** \brief 50F4, Error Information Register 1 */
#define MTU_MC80_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00660F4u)

/** \brief 50F6, Error Information Register 2 */
#define MTU_MC80_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00660F6u)

/** \brief 50F8, Error Information Register 3 */
#define MTU_MC80_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00660F8u)

/** \brief 50FA, Error Information Register 4 */
#define MTU_MC80_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00660FAu)

/** \brief 5100, Configuration Registers */
#define MTU_MC81_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0066100u)

/** \brief 5102, Configuration Register 1 */
#define MTU_MC81_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0066102u)

/** \brief 5104, MBIST Control Register */
#define MTU_MC81_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0066104u)

/** \brief 5106, Status Register */
#define MTU_MC81_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0066106u)

/** \brief 5108, Range Register, single address mode */
#define MTU_MC81_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0066108u)

/** \brief 510C, Revision ID Register */
#define MTU_MC81_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006610Cu)

/** \brief 510E, ECC Safety Register */
#define MTU_MC81_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006610Eu)

