HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxMtu_reg.h
/** \brief 51B2, Read Data and Bit Flip Register 41 */
#define MTU_MC81_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00661B2u)

/** \brief 51B4, Read Data and Bit Flip Register 42 */
#define MTU_MC81_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00661B4u)

/** \brief 51B6, Read Data and Bit Flip Register 43 */
#define MTU_MC81_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00661B6u)

/** \brief 51B8, Read Data and Bit Flip Register 44 */
#define MTU_MC81_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00661B8u)

/** \brief 51BA, Read Data and Bit Flip Register 45 */
#define MTU_MC81_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00661BAu)

/** \brief 51BC, Read Data and Bit Flip Register 46 */
#define MTU_MC81_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00661BCu)

/** \brief 51BE, Read Data and Bit Flip Register 47 */
#define MTU_MC81_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00661BEu)

/** \brief 51C0, Read Data and Bit Flip Register 48 */
#define MTU_MC81_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00661C0u)

/** \brief 51C2, Read Data and Bit Flip Register 49 */
#define MTU_MC81_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00661C2u)

/** \brief 51C4, Read Data and Bit Flip Register 50 */
#define MTU_MC81_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00661C4u)

/** \brief 51C6, Read Data and Bit Flip Register 51 */
#define MTU_MC81_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00661C6u)

/** \brief 51C8, Read Data and Bit Flip Register 52 */
#define MTU_MC81_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00661C8u)

/** \brief 51CA, Read Data and Bit Flip Register 53 */
#define MTU_MC81_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00661CAu)

/** \brief 51CC, Read Data and Bit Flip Register 54 */
#define MTU_MC81_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00661CCu)

/** \brief 51CE, Read Data and Bit Flip Register 55 */
#define MTU_MC81_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00661CEu)

/** \brief 51D0, Read Data and Bit Flip Register 56 */
#define MTU_MC81_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00661D0u)

/** \brief 51D2, Read Data and Bit Flip Register 57 */
#define MTU_MC81_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00661D2u)

/** \brief 51D4, Read Data and Bit Flip Register 58 */
#define MTU_MC81_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00661D4u)

/** \brief 51D6, Read Data and Bit Flip Register 59 */
#define MTU_MC81_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00661D6u)

/** \brief 51D8, Read Data and Bit Flip Register 60 */
#define MTU_MC81_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00661D8u)

/** \brief 51DA, Read Data and Bit Flip Register 61 */
#define MTU_MC81_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00661DAu)

/** \brief 51DC, Read Data and Bit Flip Register 62 */
#define MTU_MC81_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00661DCu)

/** \brief 51DE, Read Data and Bit Flip Register 63 */
#define MTU_MC81_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00661DEu)

/** \brief 51E0, Read Data and Bit Flip Register 64 */
#define MTU_MC81_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00661E0u)

/** \brief 51E2, Read Data and Bit Flip Register 65 */
#define MTU_MC81_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00661E2u)

/** \brief 51E4, Read Data and Bit Flip Register 66 */
#define MTU_MC81_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00661E4u)

/** \brief 51EE, Alarm Sources Configuration Register */
#define MTU_MC81_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF00661EEu)

/** \brief 51F0, SSH Safety Faults Status Register  */
#define MTU_MC81_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF00661F0u)

/** \brief 51F2, Error Information Register 0 */
#define MTU_MC81_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00661F2u)

/** \brief 51F4, Error Information Register 1 */
#define MTU_MC81_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00661F4u)

/** \brief 51F6, Error Information Register 2 */
#define MTU_MC81_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00661F6u)

/** \brief 51F8, Error Information Register 3 */
#define MTU_MC81_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00661F8u)

/** \brief 51FA, Error Information Register 4 */
#define MTU_MC81_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00661FAu)

/** \brief 5200, Configuration Registers */
#define MTU_MC82_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0066200u)

/** \brief 5202, Configuration Register 1 */
#define MTU_MC82_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0066202u)

/** \brief 5204, MBIST Control Register */
#define MTU_MC82_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0066204u)

/** \brief 5206, Status Register */
#define MTU_MC82_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0066206u)

/** \brief 5208, Range Register, single address mode */
#define MTU_MC82_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0066208u)

/** \brief 520C, Revision ID Register */
#define MTU_MC82_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006620Cu)

/** \brief 520E, ECC Safety Register */
#define MTU_MC82_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006620Eu)

/** \brief 5210, Memory ECC Detection Register */
#define MTU_MC82_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0066210u)

/** \brief 5212, Error Tracking Register 0 */
#define MTU_MC82_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066212u)

/** \brief 5214, Error Tracking Register 1 */
#define MTU_MC82_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066214u)

/** \brief 5216, Error Tracking Register 2 */
#define MTU_MC82_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066216u)

/** \brief 5218, Error Tracking Register 3 */
#define MTU_MC82_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066218u)

/** \brief 521A, Error Tracking Register 4 */
#define MTU_MC82_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006621Au)

