HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxMtu_reg.h
/** \brief 59FA, Error Information Register 4 */
#define MTU_MC89_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00669FAu)

/** \brief 5A00, Configuration Registers */
#define MTU_MC90_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0066A00u)

/** \brief 5A02, Configuration Register 1 */
#define MTU_MC90_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0066A02u)

/** \brief 5A04, MBIST Control Register */
#define MTU_MC90_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0066A04u)

/** \brief 5A06, Status Register */
#define MTU_MC90_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0066A06u)

/** \brief 5A08, Range Register, single address mode */
#define MTU_MC90_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0066A08u)

/** \brief 5A0C, Revision ID Register */
#define MTU_MC90_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF0066A0Cu)

/** \brief 5A0E, ECC Safety Register */
#define MTU_MC90_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF0066A0Eu)

/** \brief 5A10, Memory ECC Detection Register */
#define MTU_MC90_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0066A10u)

/** \brief 5A12, Error Tracking Register 0 */
#define MTU_MC90_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066A12u)

/** \brief 5A14, Error Tracking Register 1 */
#define MTU_MC90_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066A14u)

/** \brief 5A16, Error Tracking Register 2 */
#define MTU_MC90_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066A16u)

/** \brief 5A18, Error Tracking Register 3 */
#define MTU_MC90_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066A18u)

/** \brief 5A1A, Error Tracking Register 4 */
#define MTU_MC90_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066A1Au)

/** \brief 5A60, Read Data and Bit Flip Register 0 */
#define MTU_MC90_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066A60u)

/** \brief 5A62, Read Data and Bit Flip Register 1 */
#define MTU_MC90_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066A62u)

/** \brief 5A64, Read Data and Bit Flip Register 2 */
#define MTU_MC90_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066A64u)

/** \brief 5A66, Read Data and Bit Flip Register 3 */
#define MTU_MC90_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066A66u)

/** \brief 5A68, Read Data and Bit Flip Register 4 */
#define MTU_MC90_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066A68u)

/** \brief 5A6A, Read Data and Bit Flip Register 5 */
#define MTU_MC90_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066A6Au)

/** \brief 5A6C, Read Data and Bit Flip Register 6 */
#define MTU_MC90_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066A6Cu)

/** \brief 5A6E, Read Data and Bit Flip Register 7 */
#define MTU_MC90_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066A6Eu)

/** \brief 5A70, Read Data and Bit Flip Register 8 */
#define MTU_MC90_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066A70u)

/** \brief 5A72, Read Data and Bit Flip Register 9 */
#define MTU_MC90_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066A72u)

/** \brief 5A74, Read Data and Bit Flip Register 10 */
#define MTU_MC90_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066A74u)

/** \brief 5A76, Read Data and Bit Flip Register 11 */
#define MTU_MC90_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066A76u)

/** \brief 5A78, Read Data and Bit Flip Register 12 */
#define MTU_MC90_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066A78u)

/** \brief 5A7A, Read Data and Bit Flip Register 13 */
#define MTU_MC90_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066A7Au)

/** \brief 5A7C, Read Data and Bit Flip Register 14 */
#define MTU_MC90_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066A7Cu)

/** \brief 5A7E, Read Data and Bit Flip Register 15 */
#define MTU_MC90_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066A7Eu)

/** \brief 5A80, Read Data and Bit Flip Register 16 */
#define MTU_MC90_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066A80u)

/** \brief 5A82, Read Data and Bit Flip Register 17 */
#define MTU_MC90_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066A82u)

/** \brief 5A84, Read Data and Bit Flip Register 18 */
#define MTU_MC90_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066A84u)

/** \brief 5A86, Read Data and Bit Flip Register 19 */
#define MTU_MC90_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066A86u)

/** \brief 5A88, Read Data and Bit Flip Register 20 */
#define MTU_MC90_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066A88u)

/** \brief 5A8A, Read Data and Bit Flip Register 21 */
#define MTU_MC90_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066A8Au)

/** \brief 5A8C, Read Data and Bit Flip Register 22 */
#define MTU_MC90_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066A8Cu)

/** \brief 5A8E, Read Data and Bit Flip Register 23 */
#define MTU_MC90_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066A8Eu)

/** \brief 5A90, Read Data and Bit Flip Register 24 */
#define MTU_MC90_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066A90u)

/** \brief 5A92, Read Data and Bit Flip Register 25 */
#define MTU_MC90_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066A92u)

/** \brief 5A94, Read Data and Bit Flip Register 26 */
#define MTU_MC90_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066A94u)

/** \brief 5A96, Read Data and Bit Flip Register 27 */
#define MTU_MC90_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066A96u)

/** \brief 5A98, Read Data and Bit Flip Register 28 */
#define MTU_MC90_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066A98u)

/** \brief 5A9A, Read Data and Bit Flip Register 29 */
#define MTU_MC90_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066A9Au)

/** \brief 5A9C, Read Data and Bit Flip Register 30 */
#define MTU_MC90_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066A9Cu)

/** \brief 5A9E, Read Data and Bit Flip Register 31 */
#define MTU_MC90_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066A9Eu)

/** \brief 5AA0, Read Data and Bit Flip Register 32 */
#define MTU_MC90_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066AA0u)

/** \brief 5AA2, Read Data and Bit Flip Register 33 */
#define MTU_MC90_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066AA2u)

/** \brief 5AA4, Read Data and Bit Flip Register 34 */
#define MTU_MC90_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066AA4u)

