HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxMtu_reg.h
/** \brief 5F72, Read Data and Bit Flip Register 9 */
#define MTU_MC95_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066F72u)

/** \brief 5F74, Read Data and Bit Flip Register 10 */
#define MTU_MC95_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066F74u)

/** \brief 5F76, Read Data and Bit Flip Register 11 */
#define MTU_MC95_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066F76u)

/** \brief 5F78, Read Data and Bit Flip Register 12 */
#define MTU_MC95_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066F78u)

/** \brief 5F7A, Read Data and Bit Flip Register 13 */
#define MTU_MC95_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066F7Au)

/** \brief 5F7C, Read Data and Bit Flip Register 14 */
#define MTU_MC95_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066F7Cu)

/** \brief 5F7E, Read Data and Bit Flip Register 15 */
#define MTU_MC95_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066F7Eu)

/** \brief 5F80, Read Data and Bit Flip Register 16 */
#define MTU_MC95_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066F80u)

/** \brief 5F82, Read Data and Bit Flip Register 17 */
#define MTU_MC95_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066F82u)

/** \brief 5F84, Read Data and Bit Flip Register 18 */
#define MTU_MC95_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066F84u)

/** \brief 5F86, Read Data and Bit Flip Register 19 */
#define MTU_MC95_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066F86u)

/** \brief 5F88, Read Data and Bit Flip Register 20 */
#define MTU_MC95_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066F88u)

/** \brief 5F8A, Read Data and Bit Flip Register 21 */
#define MTU_MC95_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066F8Au)

/** \brief 5F8C, Read Data and Bit Flip Register 22 */
#define MTU_MC95_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066F8Cu)

/** \brief 5F8E, Read Data and Bit Flip Register 23 */
#define MTU_MC95_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066F8Eu)

/** \brief 5F90, Read Data and Bit Flip Register 24 */
#define MTU_MC95_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066F90u)

/** \brief 5F92, Read Data and Bit Flip Register 25 */
#define MTU_MC95_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066F92u)

/** \brief 5F94, Read Data and Bit Flip Register 26 */
#define MTU_MC95_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066F94u)

/** \brief 5F96, Read Data and Bit Flip Register 27 */
#define MTU_MC95_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066F96u)

/** \brief 5F98, Read Data and Bit Flip Register 28 */
#define MTU_MC95_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066F98u)

/** \brief 5F9A, Read Data and Bit Flip Register 29 */
#define MTU_MC95_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066F9Au)

/** \brief 5F9C, Read Data and Bit Flip Register 30 */
#define MTU_MC95_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066F9Cu)

/** \brief 5F9E, Read Data and Bit Flip Register 31 */
#define MTU_MC95_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066F9Eu)

/** \brief 5FA0, Read Data and Bit Flip Register 32 */
#define MTU_MC95_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FA0u)

/** \brief 5FA2, Read Data and Bit Flip Register 33 */
#define MTU_MC95_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FA2u)

/** \brief 5FA4, Read Data and Bit Flip Register 34 */
#define MTU_MC95_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FA4u)

/** \brief 5FA6, Read Data and Bit Flip Register 35 */
#define MTU_MC95_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FA6u)

/** \brief 5FA8, Read Data and Bit Flip Register 36 */
#define MTU_MC95_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FA8u)

/** \brief 5FAA, Read Data and Bit Flip Register 37 */
#define MTU_MC95_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FAAu)

/** \brief 5FAC, Read Data and Bit Flip Register 38 */
#define MTU_MC95_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FACu)

/** \brief 5FAE, Read Data and Bit Flip Register 39 */
#define MTU_MC95_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FAEu)

/** \brief 5FB0, Read Data and Bit Flip Register 40 */
#define MTU_MC95_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FB0u)

/** \brief 5FB2, Read Data and Bit Flip Register 41 */
#define MTU_MC95_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FB2u)

/** \brief 5FB4, Read Data and Bit Flip Register 42 */
#define MTU_MC95_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FB4u)

/** \brief 5FB6, Read Data and Bit Flip Register 43 */
#define MTU_MC95_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FB6u)

/** \brief 5FB8, Read Data and Bit Flip Register 44 */
#define MTU_MC95_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FB8u)

/** \brief 5FBA, Read Data and Bit Flip Register 45 */
#define MTU_MC95_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FBAu)

/** \brief 5FBC, Read Data and Bit Flip Register 46 */
#define MTU_MC95_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FBCu)

/** \brief 5FBE, Read Data and Bit Flip Register 47 */
#define MTU_MC95_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FBEu)

/** \brief 5FC0, Read Data and Bit Flip Register 48 */
#define MTU_MC95_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FC0u)

/** \brief 5FC2, Read Data and Bit Flip Register 49 */
#define MTU_MC95_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FC2u)

/** \brief 5FC4, Read Data and Bit Flip Register 50 */
#define MTU_MC95_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066FC4u)

